tagDict = {'先锋':[[2,'夜刀'],[3,'芬'],[3,'翎羽'],[3,'香草'],[4,'红豆'],[4,'清道夫'],[5,'德克萨斯'],[5,'凛冬']],
'近卫':[[1,'Castle-3'],[3,'玫兰莎'],[3,'泡普卡'],[3,'月见夜'],[4,'艾丝黛尔'],[4,'缠丸'],[4,'杜宾'],[4,'猎蜂'],[4,'慕斯'],[4,'霜叶'],[5,'诗怀雅'],[5,'因陀罗'],[5,'幽灵鲨']],
'狙击':[[2,'巡林者'],[3,'安德切尔'],[3,'克洛丝'],[3,'空爆'],[4,'白雪'],[4,'杰西卡'],[4,'流星'],[5,'白金'],[5,'蓝毒'],[5,'普罗旺斯'],[5,'守林人'],[5,'陨星']],
'重装':[[2,'黑角'],[3,'斑点'],[3,'米格鲁'],[4,'古米'],[4,'角峰'],[4,'蛇屠箱'],[5,'火神'],[5,'可颂'],[5,'雷蛇'],[5,'临光']],'医疗':[[1,'Lancet-2'],[3,'安赛尔'],
        [3,'芙蓉'],[4,'调香师'],[4,'末药'],[5,'白面鸮'],[5,'赫默'],[5,'华法琳']],
'辅助':[[3,'梓兰'],[4,'地灵'],[5,'初雪'],[5,'梅尔'],[5,'真理']],
'术师':[[2,'12F'],[2,'杜林'],[3,'史都华德'],[3,'炎熔'],[4,'格雷伊'],[4,'夜烟'],[4,'远山'],[5,'夜魔']],
'特种':[[1,'THRM-EX'],[4,'阿消'],[4,'暗索'],[4,'砾'],[5,'红'],[5,'狮蝎'],[5,'食铁兽'],[5,'崖心']],
'近战位':[[1,'Castle-3'],[1,'THRM-EX'],[2,'夜刀'],[2,'黑角'],[3,'芬'],[3,'翎羽'],[3,'香草'],[3,'玫兰莎'],[3,'泡普卡'],[3,'月见夜'],[3,'斑点'],
        [3,'米格鲁'],[4,'红豆'],[4,'清道夫'],[4,'艾丝黛尔'],[4,'缠丸'],[4,'杜宾'],[4,'猎蜂'],[4,'慕斯'],[4,'霜叶'],[4,'古米'],[4,'角峰'],[4,'蛇屠箱'],
        [4,'阿消'],[4,'暗索'],[4,'砾'],[5,'德克萨斯'],[5,'凛冬'],[5,'诗怀雅'],[5,'因陀罗'],[5,'幽灵鲨'],[5,'火神'],[5,'可颂'],[5,'雷蛇'],[5,'临光'],
        [5,'红'],[5,'狮蝎'],[5,'食铁兽'],[5,'崖心']],
'远程位':[[1,'Lancet-2'],[2,'巡林者'],[2,'12F'],[2,'杜林'],[3,'安德切尔'],[3,'克洛丝'],[3,'空爆'],[3,'安赛尔'],[3,'芙蓉'],[3,'梓兰'],
        [3,'史都华德'],[3,'炎熔'],[4,'白雪'],[4,'杰西卡'],[4,'流星'],[4,'调香师'],[4,'末药'],[4,'地灵'],[4,'格雷伊'],[4,'夜烟'],[4,'远山'],[5,'白金'],
        [5,'蓝毒'],[5,'普罗旺斯'],[5,'守林人'],[5,'陨星'],[5,'白面鸮'],[5,'赫默'],[5,'华法琳'],[5,'初雪'],[5,'梅尔'],[5,'真理'],[5,'夜魔']],
'新手':[[2,'夜刀'],[2,'巡林者'],[2,'黑角'],[2,'12F'],[2,'杜林']],
'资深干员':[[5,'德克萨斯'],[5,'凛冬'],[5,'诗怀雅'],[5,'因陀罗'],[5,'幽灵鲨'],[5,'白金'],[5,'蓝毒'],[5,'普罗旺斯'],[5,'守林人'],[5,'陨星'],
        [5,'火神'],[5,'可颂'],[5,'雷蛇'],[5,'临光'],[5,'白面鸮'],[5,'赫默'],[5,'华法琳'],[5,'初雪'],[5,'梅尔'],[5,'真理'],[5,'夜魔'],[5,'红'],[5,'狮蝎'],[5,'食铁兽'],[5,'崖心']],
'高级资深干员':[[6,'推进之王'],[6,'陈'],[6,'斯卡蒂'],[6,'银灰'],[6,'能天使'],[6,'塞雷娅'],[6,'星熊'],[6,'闪灵'],[6,'夜莺'],[6,'伊芙利特']],
'治疗':[[1,'Lancet-2'],[3,'斑点'],[3,'安赛尔'],[3,'芙蓉'],[4,'古米'],[4,'调香师'],[4,'末药'],[5,'临光'],[5,'白面鸮'],[5,'赫默'],[5,'华法琳'],[5,'夜魔']],
'支援':[[1,'Castle-3'],[4,'杜宾'],[5,'凛冬'],[5,'诗怀雅'],[5,'白面鸮'],[5,'华法琳']],
'输出':[[3,'翎羽'],[3,'玫兰莎'],[3,'月见夜'],[3,'安德切尔'],[3,'克洛丝'],[3,'史都华德'],[4,'红豆'],[4,'清道夫'],[4,'缠丸'],[4,'杜宾'],[4,'猎蜂'],
        [4,'慕斯'],[4,'霜叶'],[4,'杰西卡'],[4,'流星'],[4,'夜烟'],[5,'诗怀雅'],[5,'因陀罗'],[5,'白金'],[5,'蓝毒'],[5,'普罗旺斯'],[5,'守林人'],[5,'火神'],
        [5,'雷蛇'],[5,'真理'],[5,'夜魔'],[5,'狮蝎'],[5,'崖心']],
'群攻':[[3,'泡普卡'],[3,'空爆'],[3,'炎熔'],[4,'艾丝黛尔'],[4,'白雪'],[4,'格雷伊'],[4,'远山'],[5,'幽灵鲨'],[5,'陨星']],
'减速':[[3,'梓兰'],[4,'霜叶'],[4,'白雪'],[4,'地灵'],[4,'格雷伊'],[5,'真理'],[5,'夜魔'],[5,'食铁兽']],
'生存':[[3,'玫兰莎'],[3,'泡普卡'],[4,'艾丝黛尔'],[4,'缠丸'],[4,'杰西卡'],[5,'因陀罗'],[5,'幽灵鲨'],[5,'火神'],[5,'狮蝎']],
'防护':[[3,'斑点'],[3,'米格鲁'],[4,'古米'],[4,'角峰'],[4,'蛇屠箱'],[4,'砾'],[5,'火神'],[5,'可颂'],[5,'雷蛇'],[5,'临光']],
'削弱':[[4,'流星'],[4,'夜烟'],[5,'陨星'],[5,'初雪']],
'位移':[[4,'阿消'],[4,'暗索'],[5,'可颂'],[5,'食铁兽'],[5,'崖心']],
'控场':[[5,'德克萨斯'],[5,'梅尔'],[5,'红']],'爆发':[[1,'THRM-EX'],[5,'守林人']],
'召唤':[[5,'梅尔']],
'快速复活':[[4,'砾'],[5,'红']],
'费用回复':[[3,'芬'],[3,'翎羽'],[3,'香草'],[4,'红豆'],[4,'清道夫'],[5,'德克萨斯'],[5,'凛冬']],
'支援机械':[[1,'Castle-3'],[1,'Lancet-2'],[1,'THRM-EX']]}

testList = ['快速复活', '输出', '治疗', '近卫', '特种']

tag0 = tagDict.get(testList[0])
tag1 = tagDict.get(testList[1])
tag2 = tagDict.get(testList[2])
tag3 = tagDict.get(testList[3])
tag4 = tagDict.get(testList[4])

tagall = tag0 + tag1 + tag2 + tag3 + tag4
tagnew = []
for i in tagall:
    if i not in tagnew:
        tagnew.append(i)

ans = dict()
for each in tagnew:
    if each in tag0:
        temp = ans.get(testList[0], [])
        temp.append(each)
        ans[testList[0]] = temp
        if each in tag1:
            temp = ans.get(testList[0] + '+' + testList[1], [])
            temp.append(each)
            ans[testList[0] + '+' + testList[1]] = temp
            if each in tag2:
                temp = ans.get(testList[0] + '+' + testList[1] + '+' + testList[2], [])
                temp.append(each)
                ans[testList[0] + '+' + testList[1] + '+' + testList[2]] = temp
                if each in tag3:
                    temp = ans.get(testList[0] + '+' + testList[1] + '+' + testList[2] + '+' + testList[3], [])
                    temp.append(each)
                    ans[testList[0] + '+' + testList[1] + '+' + testList[2] + '+' + testList[3]] = temp
                    if each in tag4:
                        temp = ans.get(testList[0] + '+' + testList[1] + '+' + testList[2] + '+' + testList[3] + '+' + testList[4], [])
                        temp.append(each)
                        ans[testList[0] + '+' + testList[1] + '+' + testList[2] + '+' + testList[3] + '+' + testList[4]] = temp
    if each in tag1:
        temp = ans.get(testList[1], [])
        temp.append(each)
        ans[testList[1]] = temp
        if each in tag2:
            temp = ans.get(testList[1] + '+' + testList[2], [])
            temp.append(each)
            ans[testList[1] + '+' + testList[2]] = temp
            if each in tag3:
                temp = ans.get(testList[1] + '+' + testList[2] + '+' + testList[3], [])
                temp.append(each)
                ans[testList[1] + '+' + testList[2] + '+' + testList[3]] = temp
                if each in tag4:
                    temp = ans.get(testList[1] + '+' + testList[2] + '+' + testList[3] + '+' + testList[4], [])
                    temp.append(each)
                    ans[testList[1] + '+' + testList[2] + '+' + testList[3] + '+' + testList[4]] = temp
    if each in tag2:
        temp = ans.get(testList[2], [])
        temp.append(each)
        ans[testList[2]] = temp
        if each in tag3:
            temp = ans.get(testList[2] + '+' + testList[3], [])
            temp.append(each)
            ans[testList[2] + '+' + testList[3]] = temp
            if each in tag4:
                temp = ans.get(testList[2] + '+' + testList[3] + '+' + testList[4], [])
                temp.append(each)
                ans[testList[2] + '+' + testList[3] + '+' + testList[4]] = temp
    if each in tag3:
        temp = ans.get(testList[3], [])
        temp.append(each)
        ans[testList[3]] = ans.get(testList[3], [])
        if each in tag4:
            temp = ans.get(testList[3] + '+' + testList[4], [])
            temp.append(each)
            ans[testList[3] + '+' + testList[4]] = temp
    if each in tag4:
        temp = ans.get(testList[4], [])
        temp.append(each)
        ans[testList[4]] = temp

print(ans)